УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/CommonModules/сфпСофтФонПроСервер/Module.bsl
&ИзменениеИКонтроль("СоздатьТелефонныйЗвонок")
Функция смарт_СоздатьТелефонныйЗвонок(Абонент, НомерТелефонаАбонента, Пользователь, Сотрудник, ВнутреннийНомерПользователя, Входящий, ДатаНачалаРазговора, ИдентификаторЗвонкаВАТС)
	
	ТелефонныйЗвонок = Неопределено;
	Если ИдентификаторЗвонкаВАТС <> Неопределено Тогда

		#Удаление //++ #1947 смарт: Лопато 13.08.2024 //Телефония. Дубли звонков
		ТелефонныйЗвонок = НайтиТелефонныйЗвонокПоДаннымЗвонка(,, ИдентификаторЗвонкаВАТС);
		#КонецУдаления
		
		#Вставка
		//++ #1947 смарт: Лопато 13.08.2024 //Телефония. Дубли звонков  
		ТелефонныйЗвонок = смартНайтиТелефонныйЗвонокПоIDЗвонка(ИдентификаторЗвонкаВАТС);
		//-- #1947 смарт: Лопато 13.08.2024
		#КонецВставки
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТелефонныйЗвонок) Тогда
		Возврат ТелефонныйЗвонок;
	КонецЕсли;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	ИмяДокументаТелефонныйЗвонок = СтрЗаменить(сфпСофтФонПроСервер.сфпИмяДокументаТелефонныйЗвонок(), "Документ.", "");
	РеквизитыДокумента = Метаданные.Документы[ИмяДокументаТелефонныйЗвонок].Реквизиты;
	
	ТелефонныйЗвонокОбъект	= Документы[ИмяДокументаТелефонныйЗвонок].СоздатьДокумент();
	
	#Удаление
	//ТелефонныйЗвонокОбъект.Заполнить(Неопределено);
	ТелефонныйЗвонокОбъект.Входящий = Входящий;
	ТелефонныйЗвонокОбъект.Дата = ТекущаяДатаСеанса();
	ТелефонныйЗвонокОбъект.Автор = сфпСофтФонПроСервер.сфпТекущийПользователь();
	ТелефонныйЗвонокОбъект.Ответственный = ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, ТелефонныйЗвонокОбъект.Автор);
	#КонецУдаления
	
	#Вставка
	//++#1359 смарт: Балашов 18.05.2023
	АТС = "";
	Если ТипЗнч(Входящий) = Тип("Структура") Тогда
		ТелефонныйЗвонокОбъект.Дата = ДатаНачалаРазговора;
		ТелефонныйЗвонокОбъект.Входящий = Входящий["Входящий"];
		ТелефонныйЗвонокОбъект.Комментарий = Входящий["Комментарий"];
		ТелефонныйЗвонокОбъект.сфпДлительностьЗвонка = Входящий["Продолжительность"];
		Если Входящий.Свойство("АТС") и ЗначениеЗаполнено(Входящий["АТС"]) Тогда
			АТС = " ("+Входящий["АТС"]+")";
		КонецЕсли;	
		Если Входящий["Пропущенный"] Тогда
			ТелефонныйЗвонокОбъект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный;
		Иначе
			ТелефонныйЗвонокОбъект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Отвеченный;
		КонецЕсли;	
	Иначе
		ТелефонныйЗвонокОбъект.Входящий = Входящий;
		ТелефонныйЗвонокОбъект.сфпДлительностьЗвонка = 0;
		ТелефонныйЗвонокОбъект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;	 
	
	//++#1359 смарт: Лопато 13.09.2023 //Доработать регистрацию звонков в 1С (интеграция с ВАТС и Asterisk)  
	НомерТелефонаАбонента = смартОбщегоНазначения.ПривестиТелефонныйНомерКФормату(НомерТелефонаАбонента);
	#КонецВставки
	
	ТелефонныйЗвонокОбъект.АбонентКакСвязаться = НомерТелефонаАбонента; 
	ТелефонныйЗвонокОбъект.АбонентПредставление = НСтр("ru='!!!Не определен!!!';en='!!!Undefined!!!'");
	
	#Вставка
	Если ЗначениеЗаполнено(ИдентификаторЗвонкаВАТС) Тогда 
		ТелефонныйЗвонокОбъект.Ответственный = ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, ТелефонныйЗвонокОбъект.Автор);
		ТелефонныйЗвонокОбъект.Автор = ТелефонныйЗвонокОбъект.Ответственный;
	Иначе	
		ТелефонныйЗвонокОбъект.Автор = сфпСофтФонПроСервер.сфпТекущийПользователь();
		ТелефонныйЗвонокОбъект.Ответственный = ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, ТелефонныйЗвонокОбъект.Автор);
	КонецЕсли;
	#КонецВставки
	
	ТелефонныйЗвонокОбъект.сфпИдентификаторЗвонка = ИдентификаторЗвонкаВАТС;
	
	#Удаление
	ТелефонныйЗвонокОбъект.сфпДлительностьЗвонка = 0;
	ТелефонныйЗвонокОбъект.Описание = сфпСофтФонПроСервер.сфпЗаполнитьОписаниеТелефонногоЗвонка(ТелефонныйЗвонокОбъект.сфпДлительностьЗвонка);
	#КонецУдаления
	
	#Вставка
	Если ЗначениеЗаполнено(ТелефонныйЗвонокОбъект.сфпДлительностьЗвонка) Тогда
		ТелефонныйЗвонокОбъект.Описание = сфпСофтФонПроСервер.сфпЗаполнитьОписаниеТелефонногоЗвонка(ТелефонныйЗвонокОбъект.сфпДлительностьЗвонка) + АТС;
	Иначе
		ТелефонныйЗвонокОбъект.Описание = "Ожидание загрузки данных из АТС" + АТС;
	КонецЕсли;	
	//--#1359 смарт: Лопато 13.09.2023
	//--#1359 смарт: Балашов 18.05.2023
	#КонецВставки
	
	КаналПервичногоИнтереса = "";
	ИсточникПервичногоИнтереса = "";
	ИзменитьCRM_СостоянияЛидов = Ложь; // +CRM
				
	Если ТелефонныйЗвонокОбъект.Входящий Тогда
		ТелефонныйЗвонокОбъект.сфпСостояниеЗвонка = Перечисления.сфпСостоянияЗвонков.Пропущенный;
		
		МенеджерЗаписи = РегистрыСведений.сфпДанныеКоллтрекинга.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.НомерТелефона = Прав(ТелефонныйЗвонокОбъект.АбонентКакСвязаться, 10);
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			Если МенеджерЗаписи.Оператор = Перечисления.CRM_CallTrakingСценарии.Comagic
				ИЛИ МенеджерЗаписи.Оператор = Перечисления.CRM_CallTrakingСценарии.UIS Тогда
				
				ТелефонныйЗвонокОбъект["сфпCoMagicID"] = МенеджерЗаписи.Идентификатор;
			КонецЕсли;
			
			ТелефонныйЗвонокОбъект["Комментарий"] = ТелефонныйЗвонокОбъект["Комментарий"] + ?(НЕ ЗначениеЗаполнено(ТелефонныйЗвонокОбъект["Комментарий"]), "", Символы.ПС)
				+ НСтр("ru='Сайт: ';en='Website: '") + МенеджерЗаписи.Сайт + Символы.ПС
				+ НСтр("ru='Ключевые слова: ';en='Keywords: '") + МенеджерЗаписи.utm_term + Символы.ПС
				+ НСтр("ru='Объявление: ';en='Content: '") + МенеджерЗаписи.utm_content;
					
			// +CRM
			КаналПервичногоИнтереса = МенеджерЗаписи.КаналПервичногоИнтереса;
			ИсточникПервичногоИнтереса = МенеджерЗаписи.ИсточникПервичногоИнтереса;
			
			Если ЗначениеЗаполнено(МенеджерЗаписи.Заявка) Тогда
				ТелефонныйЗвонокОбъект["ВзаимодействиеОснование"] = МенеджерЗаписи.Заявка;
				ИзменитьCRM_СостоянияЛидов = Истина;
				
				ЗаявкаОбъект = МенеджерЗаписи.Заявка.ПолучитьОбъект();
				Если НЕ ЗаявкаОбъект.CRM_СкрытьВАРМ Тогда
					ЗаявкаОбъект.CRM_СкрытьВАРМ = Истина;
					ЗаявкаОбъект.ДополнительныеСвойства.Вставить("НеЗапускатьТриггер", Истина);
					ЗаявкаОбъект.Записать();
				КонецЕсли;
			КонецЕсли;
			// -CRM
			
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЕсли;
	
	Если ТелефонныйЗвонокОбъект.Важность.Метаданные().Имя = "ВариантыВажностиЗадачи" Тогда
		  ТелефонныйЗвонокОбъект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	Иначе ТелефонныйЗвонокОбъект.Важность = Перечисления.ВариантыВажностиВзаимодействия.Обычная;
	КонецЕсли;
	
	Если РеквизитыДокумента.Найти("Тема") <> Неопределено Тогда
		ТелефонныйЗвонокОбъект.Тема = сфпСофтФонПроСервер.сфпЗаполнитьТемуТелефонногоЗвонка(ТелефонныйЗвонокОбъект.Входящий, ТелефонныйЗвонокОбъект.Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Абонент) Тогда
		ТелефонныйЗвонокОбъект.АбонентПредставление = "" + Абонент;
		ТелефонныйЗвонокОбъект.АбонентКонтакт = Абонент;
	КонецЕсли;	
	
	Попытка
		ТелефонныйЗвонокОбъект.УстановитьНовыйНомер();
		ТелефонныйЗвонокОбъект.Записать();
		ТелефонныйЗвонок = ТелефонныйЗвонокОбъект.Ссылка;
		
		// РегистрСведений.сфпИсторияЗвонков
		Если ЗначениеЗаполнено(ДатаНачалаРазговора) Тогда
			ДатаСобытия = ДатаНачалаРазговора;
		Иначе
			ДатаСобытия = ТелефонныйЗвонокОбъект.Дата;
		КонецЕсли;
		
		#Удаление
		ЗаписатьДанныеЗвонка(ТелефонныйЗвонок, ИдентификаторЗвонкаВАТС, ДатаСобытия,, Входящий, Абонент, НомерТелефонаАбонента, ВнутреннийНомерПользователя, Сотрудник);
		#КонецУдаления
		#Вставка
		Если ТипЗнч(Входящий) = Тип("Структура") Тогда
			ДатаОтвета = ДатаСобытия + Входящий["ВремяОжидания"];
		Иначе
			ДатаОтвета = Неопределено;
		КонецЕсли;	
		ЗаписатьДанныеЗвонка(ТелефонныйЗвонок, ИдентификаторЗвонкаВАТС, ДатаСобытия, ДатаОтвета, ТелефонныйЗвонок.Входящий, Абонент, НомерТелефонаАбонента, ВнутреннийНомерПользователя, Сотрудник);
		#КонецВставки
		
		// +CRM
		Если ИзменитьCRM_СостоянияЛидов Тогда
			СостояниеЗаявкаПоЗвонку = Константы.CRM_СостояниеЛидаСозданоПоЗвонку.Получить();
			Если ЗначениеЗаполнено(СостояниеЗаявкаПоЗвонку) Тогда
				РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(ЗаявкаОбъект.Ссылка, СостояниеЗаявкаПоЗвонку);

			Иначе
				РегистрыСведений.CRM_СостоянияЛидов.УдалитьСостояниеЛида(ЗаявкаОбъект.Ссылка);
			КонецЕсли;
		КонецЕсли;
		// -CRM
	
		Если ЗначениеЗаполнено(КаналПервичногоИнтереса) ИЛИ ЗначениеЗаполнено(ИсточникПервичногоИнтереса) Тогда
			// Зафиксируем актуальный источник привлечения
			НаборРегистра = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьНаборЗаписей();
			НаборРегистра.Отбор.Сделка.Установить(ТелефонныйЗвонок);
		
			Партнер = Справочники.Партнеры.ПустаяСсылка();
			Если ЗначениеЗаполнено(ТелефонныйЗвонокОбъект.АбонентКонтакт) Тогда
				Если ТипЗнч(ТелефонныйЗвонокОбъект.АбонентКонтакт) = Тип("СправочникСсылка.Партнеры") ИЛИ ТипЗнч(ТелефонныйЗвонокОбъект.АбонентКонтакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
					Партнер = ТелефонныйЗвонокОбъект.АбонентКонтакт;
					
				ИначеЕсли ТипЗнч(ТелефонныйЗвонокОбъект.АбонентКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда	
					Партнер = ТелефонныйЗвонокОбъект.АбонентКонтакт.Владелец;
				КонецЕсли;
			КонецЕсли;	
			
			Запись = НаборРегистра.Добавить();
			Запись.Период = ТелефонныйЗвонокОбъект.Дата;
			Запись.Партнер = Партнер;
			Запись.Сделка = ТелефонныйЗвонок;
			Запись.ИсточникПервичногоИнтереса = ИсточникПервичногоИнтереса;
			Запись.КаналПервичногоИнтереса = КаналПервичногоИнтереса;
			
			НаборРегистра.Записать();
		КонецЕсли;
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ТелефонныйЗвонок;
	
КонецФункции  

#Область ДоработкиСмарт
//++#1359 смарт: Балашов 25.07.2023 получение ссылки на запись разговора с Asterisk    
&НаСервере
Функция смартПолучитьСсылкуНаЗаписьЗвонка(UIDЗаписи) Экспорт 
		
	//++ #1704 смарт: Ермаков 27.03.2024 / Телефония. Не прослушиваются телефонные звонки.
	////////////////////////////////////////////////////////////////////////////////////////
	// Инструкция для тех, кто сюда попал
	//  Плеер - https://sip.smart-t.me/player_uid.php?UID=1700650625-153112
	//  Получить JSON - https://sip.smart-t.me/player_uid.php?UID=1700650625-153112&JSON=Y
	//  Получить URL - https://sip.smart-t.me/player_uid.php?UID=1700650625-153112&LINK=Y
	//  script для web - https://sip.smart-t.me/player_uid.php?UID=1700650625-153112&FILE=Y
    //
	//  Если файл сегодняшний (в данной ситуации не наш случай), то можно вообще:
	//   - https://sip.smart-t.me/calls/1700650625-153112.wav
	
	АдресРесурса = "/player_uid.php?UID=" + СтрЗаменить(UIDЗаписи, ".", "-") + "&LINK=Y"; 
	
	HTTPСоединение = Новый HTTPСоединение("sip.smart-t.me",,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	HTTPОтвет = HTTPСоединение.Получить(Новый HTTPЗапрос(АдресРесурса));
	
	Если Не HTTPОтвет.КодСостояния = 200 Тогда 
		Возврат Неопределено;
	КонецЕсли;                    

	Возврат HTTPОтвет.ПолучитьТелоКакСтроку(); 
	//-- #1704 смарт: Ермаков 27.03.2024
	
КонецФункции//--#1359 смарт: Балашов 25.07.2023

//++ #1947 смарт: Лопато 13.08.2024 //Телефония. Дубли звонков  
Функция смартНайтиТелефонныйЗвонокПоIDЗвонка(UID)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Ссылка КАК ТелефонныйЗвонок
		|ИЗ
		|	Документ.ТелефонныйЗвонок
		|ГДЕ
		|	сфпИдентификаторЗвонка = &UID
		|";
	
	Запрос.УстановитьПараметр("UID", СокрЛП(UID));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ТелефонныйЗвонок;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //-- #1947 смарт: Лопато 13.08.2024

#КонецОбласти
